---
kind: method
id: M:Autodesk.Revit.DB.Plumbing.IPipeFittingAndAccessoryPressureDropServer.GetDataSchema
source: html/11d7e6cd-5e1e-c717-735f-eeb383df7e2a.htm
---
# Autodesk.Revit.DB.Plumbing.IPipeFittingAndAccessoryPressureDropServer.GetDataSchema Method

Obtains the schema of the ESEntity.

## Syntax (C#)
```csharp
Schema GetDataSchema()
```

## Returns
Null if the server has no data.